In [1]:
import pandas as pd

data = {
    'name':['张三','李四','张三','王五'],
    'sex':['male','female','male','male'],
    'year':[24,37,24,33],
    'city':['天津','深圳','天津','北京']
}

df = pd.DataFrame(data)
df

  name     sex  year city
0   张三    male    24   天津
1   李四  female    37   深圳
2   张三    male    24   天津
3   王五    male    33   北京

In [2]:
# 删除重复行
df.drop_duplicates()

  name     sex  year city
0   张三    male    24   天津
1   李四  female    37   深圳
3   王五    male    33   北京

In [3]:
# 通过指定列，删除重复行
df.drop_duplicates(['year'])

  name     sex  year city
0   张三    male    24   天津
1   李四  female    37   深圳
3   王五    male    33   北京

In [6]:
# 删除重复行,保留最后出现的
df.drop_duplicates(['year'],keep='last')

  name     sex  year city
1   李四  female    37   深圳
2   张三    male    24   天津
3   王五    male    33   北京